import { BreadcrumbItem, Breadcrumbs } from "@/components/common/breadcrumbs";
import { Icons } from "@/components/common/icons";
import { Button } from "@/components/ui/button";
import { FC } from "react";
import Balancer from "react-wrap-balancer";
import { toast } from "sonner";

const OverviewPage: FC = () => {
  return (
    <div className="container relative h-full w-full overflow-y-auto p-4">
      <main className="flex h-full w-full flex-col space-y-4">
        <section>
          <Breadcrumbs>
            <BreadcrumbItem title={"Settings"} link="/settings" />
            <BreadcrumbItem title={"Profile"} />
          </Breadcrumbs>
        </section>
        <section className="flex h-full flex-col rounded-md">
          <h1 className="text-2xl font-bold">
            ความหมายของคำว่า Carbon Footprint
          </h1>
          <Button
            onClick={() =>
              toast("Success", {
                className: "my-classname",
                duration: 5000,
                icon: <Icons.checkCircle2 className="h-6 w-6 text-green-600" />,
              })
            }
          >
            Toast
          </Button>
          <p className="text-base text-foreground">
            <Balancer>
              การปล่อยก๊าซเรือนกระจกจากกิจกรรมต่างๆ
              ของมนุษย์อย่างต่อเนื่องทั้งการใช้พลังงาน การเกษตรกรรม
              การพัฒนาและการขยายตัวของภาคอุตสาหกรรม การขนส่ง การตัดไม้ทำลายป่า
              รวมทั้งการทำลายทรัพยากรธรรมชาติและสิ่งแวดล้อมในรูปแบบอื่น ๆ
              ล้วนเป็นสาเหตุสำคัญของการเกิดภาวะโลกร้อน
              และนับวันปัญหาดังกล่าวก็ยิ่งทวีความรุนแรงมากขึ้น
              จากผลกระทบของภาวะโลกร้อน ทำให้ประเทศต่างๆ
              ทั่วโลกตื่นตัวในการดำเนินงานเพื่อลดการปล่อยก๊าซเรือนกระจก
              การจัดทำคาร์บอนฟุตพริ้นท์ขององค์กร1 (Carbon Footprint for
              Organization หรือ Corporate Carbon Footprint: CCF)
              เป็นวิธีการประเภทหนึ่งในการแสดงข้อมูลปริมาณก๊าซเรือนกระจกที่ปล่อยจากการดำเนินงานขององค์กร
              อันจะนำไปสู่การกำหนดแนวทางการบริหาร
              จัดการเพื่อลดการปล่อยก๊าซเรือนกระจกได้อย่างมีประสิทธิภาพ
              ทั้งในระดับโรงงาน ระดับอุตสาหกรรม และระดับประเทศ ซึ่งปัจจุบัน
              องค์การบริหารจัดการก๊าซเรือนกระจก (องค์การมหาชน)
              ได้จัดทำโครงการส่งเสริมการจัดทำคาร์บอนฟุตพริ้นท์ขององค์กร ดังนี้
              คาร์บอนฟุตพริ้นท์ขององค์กรในภาคอุตสาหกรรม
              คาร์บอนฟุตพริ้นท์ขององค์กรในองค์กรปกครองส่วนท้องถิ่น
              คาร์บอนฟุตพริ้นท์ขององค์กร คือ
              ปริมาณก๊าซเรือนกระจกที่ปล่อยออกมาจากกิจกรรมต่างๆ ขององค์กร เช่น
              การเผาไหม้ของเชื้อเพลิง การใช้ไฟฟ้า การจัดการของเสีย และการขนส่ง
              วัดออกมาในรูปตันคาร์บอนไดออกไซด์เทียบเท่า โดยพิจารณาจาก 3 ส่วนหลัก
              แบ่งเป็น SCOPE ดังนี้ SCOPE I: การคำนวณคาร์บอนฟุตพริ้นท์ทางตรง
              (Direct Emissions) จากกิจกรรมต่างๆ ขององค์กรโดยตรง เช่น
              การเผาไหม้ของเครื่องจักร การใช้พาหนะขององค์กร
              (ที่องค์กรเป็นเจ้าของเอง) การใช้สารเคมีในการ บำบัดน้ำเสีย
              การรั่วซึม/รั่วไหล จากกระบวนการหรือกิจกรรม เป็นต้น SCOPE II:
              การคำนวณคาร์บอนฟุตพริ้นท์ทางอ้อมจากการใช้พลังงาน (Energy Indirect
              Emissions) ได้แก่ การซื้อพลังงานมาใช้ในองค์กร ได้แก่ พลังงานไฟฟ้า
              พลังงานความร้อน พลังงานไอน้ำ เป็นต้น SCOPE III:
              การคำนวณคาร์บอนฟุตพริ้นท์ทางอ้อมด้านอื่นๆ
              การเดินทางของพนักงานด้วยพาหนะที่ไม่ใช่ขององค์กร
              การเดินทางไปสัมมนานอกสถานที่ การใช้วัสดุอุปกรณ์ต่างๆ เป็นต้น
              ประโยชน์ของการทำ CFO ภาคธุรกิจ
              สามารถประเมินปริมาณก๊าซเรือนกระจกที่ปล่อยออกมาจากกิจกรรมขององค์กร
              สามารถจำแนกสาเหตุของการปล่อยก๊าซเรือนกระจกที่มีนัยสำคัญและหาแนวทางเพื่อลดขนาดของ
              CF ปริมาณก๊าซเรือนกระจกที่ลดลง อาจนำไปขายเป็นคาร์บอนเครดิต
              หรือทำการชดเชยคาร์บอนกับองค์กรอื่นๆ ภาครัฐ
              ใช้ในการขับเคลื่อนให้เกิดการบริหารจัดการลดการปล่อยก๊าซเรือนกระจกขององค์กร
              เพื่อประโยชน์ส่วนรวมของประเทศ
            </Balancer>
          </p>
          B
        </section>
      </main>
    </div>
  );
};

export default OverviewPage;
